app/Helpers/login_helper.php

SELECT *
FROM `tb_user`
WHERE `u_id` = '1'
---
    public function userlogin()
    {
        return $this->db->table('tb_user')->where('u_id', session('u_id'))->get()->getRow();