app/Helpers/LoginHelper.php

SELECT *
FROM `tb_user`
WHERE `u_id` = '1'
---
    public function userlogin()
    {
        try {
            return $this->db->table('tb_user')->where('u_id', session('u_id'))->get()->getRow();