app/Controllers/LoginControllers.php

    public function login()
    {
        $db = \Config\Database::connect();
        $post = $this->request->getPost();
        $query = $db->table('tb_user')->getWhere(['u_npm' => $post['u_npm']]);
        $users = $query->getRow();
---
SELECT *
FROM `tb_user`
WHERE `u_npm` = '12345'