app/Controllers/MahasiswaControllers.php

SELECT *
FROM `tb_organisasi`
---
    public function listdataLKOK()
    {
        $menu = [
            'Dashboard' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_organisasi' => $this->OrganisasiModels->findAll(),
        ];

SELECT *
FROM `tb_user`
---
    public function morelkok($o_id)
    {
        $menu = [
            'Dashboard' => '',
            'Event' => 'lkok',
            'LKOK' => '',
            'tb_organisasi' => $this->OrganisasiModels->where('o_id', $o_id)->first(),
            'tb_anggotaorganisasi' => $this->AnggotaOrganisasiModels->findAll(),
            'tb_pengambilanorganisasi' => $this->PengambilanOrganisasiModels->findAll(),
            'tb_user' => $this->UsersModels->findAll(),

SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_kegiatan`
---
    public function listdataevent()
    {
        $menu = [
            'Dashboard' => '',
            'Event' => 'event',
            'LKOK' => '',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_event' => $this->KegiatanModels->findAll(),
        ];