app/Controllers/SuperAdminControllers.php

    public function editfakultas($p_id)
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => 'fakultas',
            'LKOK' => '',
            'Event' => '',
            'tb_prodi' => $this->ProdiModels->where('p_id', $p_id)->first(),
            'DataLKOK' => '',
            'DataAnggotaLKOK' => '',
            'NotipEvent' => $this->KegiatanModels->findAll(),
            'NotipUser' => $this->UsersModels->findAll(),
            'Notiprodi' => $this->ProdiModels->findAll(),
---
SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`

    public function listdataLKOK()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_organisasi' => $this->OrganisasiModels->findAll(),
            'DataLKOK' => 'datalkok',
            'DataAnggotaLKOK' => '',
            'NotipEvent' => $this->KegiatanModels->findAll(),
            'NotipUser' => $this->UsersModels->findAll(),
            'Notiprodi' => $this->ProdiModels->findAll(),
---
SELECT *
FROM `tb_organisasi`
SELECT *
FROM `tb_kegiatan`
SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`

    public function registerLKOK()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_organisasi' => $this->OrganisasiModels->findAll(),
            'DataLKOK' => 'datalkok',
            'DataAnggotaLKOK' => '',
            'NotipEvent' => $this->KegiatanModels->findAll(),
            'NotipUser' => $this->UsersModels->findAll(),
            'Notiprodi' => $this->ProdiModels->findAll(),
---
SELECT *
FROM `tb_organisasi`
SELECT *
FROM `tb_kegiatan`
SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`