app/Controllers/SuperAdminControllers.php

SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`
---
    public function listdatauser()
    {
        $menu = [
            'Dashboard' => '',
            'User' => 'user',
            'Fakultas' => '',
            'LKOK' => '',
            'Event' => '',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),

SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_user`
WHERE `u_id` = '3'
 LIMIT 1
---
    public function edituser($u_id)
    {
        $menu = [
            'Dashboard' => '',
            'User' => 'user',
            'Fakultas' => '',
            'LKOK' => '',
            'Event' => '',
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_user' => $this->UsersModels->where('u_id', $u_id)->first(),

SELECT *
FROM `tb_prodi`
---
    public function listdatafakultas()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => 'fakultas',
            'LKOK' => '',
            'Event' => '',
            'tb_prodi' => $this->ProdiModels->findAll(),

SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_organisasi`
SELECT *
FROM `tb_anggota_organisasi`
---
    public function listdataanggotaLKOK()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_organisasi' => $this->OrganisasiModels->findAll(),
            'tb_anggotaorganisasi' => $this->AnggotaOrganisasiModels->findAll(),
            'DataLKOK' => '',
            'DataAnggotaLKOK' => 'dataanggotalkok',
        ];

SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_organisasi`
---
    public function registeranggotaLKOK()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_organisasi' => $this->OrganisasiModels->findAll(),

SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`
SELECT *
FROM `tb_organisasi`
SELECT *
FROM `tb_anggota_organisasi`
WHERE `ao_id` = '3'
 LIMIT 1
---
    public function editanggotaLKOK($ao_id)
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => 'lkok',
            'Event' => '',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_organisasi' => $this->OrganisasiModels->findAll(),
            'DataLKOK' => '',
            'tb_anggotaorganisasi' => $this->AnggotaOrganisasiModels->where('ao_id', $ao_id)->first(),

SELECT *
FROM `tb_kegiatan`
---
    public function listdataevent()
    {
        $menu = [
            'Dashboard' => '',
            'User' => '',
            'Fakultas' => '',
            'LKOK' => '',
            'Event' => 'event',
            'tb_user' => $this->UsersModels->findAll(),
            'tb_prodi' => $this->ProdiModels->findAll(),
            'tb_event' => $this->KegiatanModels->findAll(),
            'DataLKOK' => '',
            'DataAnggotaLKOK' => '',
        ];