app/Controllers/UsersControllers.php

    public function dashboard()
    {
        try {
            $user = $this->loginHelper->userlogin();
            $totalUser = $this->loginHelper->countdata('tb_user', ['u_role' => 'Mahasiswa', 'OR' => ['u_role' => 'AdminLK/OK']]);
            $totalProdi = $this->loginHelper->countdata('tb_prodi');
            $totalLkok = $this->loginHelper->countdata('tb_organisasi');
            $totalEvent = $this->loginHelper->countdata('tb_kegiatan');
            $totalEventApproved = $this->loginHelper->countdata('tb_kegiatan', ['k_check_u_id' => $user->u_id]);
            $menu = [
                'Dashboard' => 'dashboard',
                'User' => '',
                'Fakultas' => '',
                'LKOK' => '',
                'Event' => '',
                'DataLKOK' => '',
                'DataAnggotaLKOK' => '',
                'NotipEvent' => $this->KegiatanModels->findAll(),
                'NotipUser' => $this->UsersModels->findAll(),
                'Notiprodi' => $this->ProdiModels->findAll(),
---
SELECT *
FROM `tb_kegiatan`
SELECT *
FROM `tb_user`
SELECT *
FROM `tb_prodi`